---
kind: method
id: M:Autodesk.Revit.Exceptions.ServerInternalException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
source: html/b23ba181-f556-4792-2cd5-f62c1d89ee99.htm
---
# Autodesk.Revit.Exceptions.ServerInternalException.GetObjectData Method

Retrieves data needed to serialize the target object.

## Syntax (C#)
```csharp
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

## Parameters
- **info** (`System.Runtime.Serialization.SerializationInfo`) - Data needed to serialize or deserialize the object.
- **context** (`System.Runtime.Serialization.StreamingContext`) - The destination of the serialized stream.